Repository: agustin-y2k/IndicatorInsight
Catalog: frontend/app/l10n/*.arb
Languages: es

source: Register
es: Registro

source: Login
es: Iniciar Sesión

source: Logout
es: Cerrar Sesión

source: Email
es: Correo Electrónico

source: Password
es: Contraseña

source: Bad Request
es: Solicitud incorrecta

# emailOrPasswordIncorrect
source: Email or password is incorrect
es: Correo electrónico o contraseña incorrectos

source: User not found
es: Usuario no encontrado

source: Internal Server Error
es: Error interno del servidor

source: Unknown error
es: Error desconocido

source: Unauthorized
es: No autorizado

source: Please fill all fields
es: Por favor, complete todos los campos

source: User already exists
es: El usuario ya existe

source: Invalid email format
es: Formato de correo electrónico inválido

# invalidPasswordFormat
source: Password must be at least 8 characters long and contain at least one digit, one uppercase letter, one lowercase letter, and one special character
es: La contraseña debe tener al menos 8 caracteres y contener al menos un dígito, una letra mayúscula, una letra minúscula y un carácter especial

source: User registered successfully
es: Usuario registrado con éxito

source: Data
es: Datos

# pleaseEnterSymbol
source: Please enter a symbol
es: Por favor, ingrese un símbolo

# pleaseEnterPeriod
source: Please enter a period
es: Por favor, ingrese al menos un período

# failedToCalculate
source: Failed to calculate: {error}
es: Error al calcular: {error}

# errorOccurred
source: An error occurred: {error}
es: Ocurrió un error: {error}

source: Indicators
es: Indicadores

source: Oscillator
es: Oscilador

source: Moving Averages
es: Medias Móviles

source: Moving Averages Type
es: Tipo de Medias Móviles

# enterPeriod
source: Period (comma separated)
es: Períodos (separados por comas)

source: Stochastic Oscillator
es: Oscilador Estocástico

source: Bollinger Bands
es: Bandas de Bollinger

source: Parabolic SAR
es: SAR Parabólico

source: Enter Symbol
es: Ingrese el símbolo

source: Get Recommendation
es: Obtener Recomendación

source: View Chart
es: Ver Gráfico

source: Strategies
es: Estrategias

source: Help
es: Ayuda

source: Recommendation
es: Recomendación

source: Trend Strength
es: Fuerza de la Tendencia

source: Last Cross
es: Último Cruce

source: Reason
es: Razón

source: Description
es: Descripción

source: BUY
es: COMPRA

source: SELL
es: VENTA

source: STRONG BUY
es: COMPRA FUERTE

source: STRONG SELL
es: VENTA FUERTE

source: Overbought
es: Sobrecompra

source: Oversold
es: Sobreventa

source: Strong Oversold
es: Sobreventa Fuerte

source: Strong Overbought
es: Sobrecompra Fuerte

source: No clear signal
es: No hay una señal clara

source: Signal Strength
es: Fuerza de la Señal

source: Strong Signal
es: Señal Fuerte

source: Moderate Signal
es: Señal Moderada

source: Weak Signal
es: Señal Débil

source: Bullish Cross
es: Cruce Alcista

source: Bearish Cross
es: Cruce Bajista

source: Divergence
es: Divergencia

source: Entry/Exit Signal
es: Señal de Entrada/Salida

source: Histogram
es: Histograma

source: Signal Line
es: Línea de Señal

source: MACD Line
es: Línea MACD

source: Bullish
es: Alcista

source: Bearish
es: Bajista

source: Date
es: Fecha

source: Value
es: Valor

source: Type
es: Tipo

source: Crossing Points
es: Puntos de Cruce

source: ADX Indicator Details
es: Detalles del Indicador ADX

source: Current ADX
es: ADX Actual

# currentDIPlus
source: Current +DI
es: DI+ Actual

# currentDIMinus
source: Current -DI
es: DI- Actual

source: Absence of clear trend
es: Ausencia de una tendencia clara

source: Clear bullish trend
es: Tendencia alcista clara

source: Clear bearish trend
es: Tendencia bajista clara

source: Sideways trend
es: Tendencia lateral

# strongBullishTrend
source: Strong bullish trend (possible peak)
es: Tendencia alcista fuerte (posible pico)

# strongBearishTrend
source: Strong bearish trend (possible peak)
es: Tendencia bajista fuerte (posible pico)

# veryStrongTrend
source: Very strong trend (trend peak)
es: Tendencia muy fuerte (pico de tendencia)

source: Understanding the indicator
es: Entendiendo el indicador

# understandingADXDesc
source: The ADX is a technical analysis indicator used to quantify the strength of a trend. It ranges from 0 to 100, with higher values indicating a stronger trend.
es: El ADX es un indicador de análisis técnico utilizado para cuantificar la fuerza de una tendencia. Va de 0 a 100, con valores más altos indicando una tendencia más fuerte.

source: Recommendation Logic:
es: Lógica de la Recomendación:

# recommendationLogicDescAdx
source: The ADX value helps determine the strength of the trend: - Below 25: Absence of clear trend. - 25 to 40: Clear trend (bullish or bearish). - 40 to 50: Strong trend (possible peak). - Above 50: Very strong trend (trend peak).
es: El valor ADX ayuda a determinar la fuerza de la tendencia: - Por debajo de 25: Ausencia de tendencia clara. - 25 a 40: Tendencia clara (alcista o bajista). - 40 a 50: Tendencia fuerte (posible pico). - Más de 50: Tendencia muy fuerte (pico de tendencia).

source: Directional Indicators:
es: Indicadores Direccionales:

# directionalIndicatorsDesc
source: The ADX is often used in conjunction with the Plus Directional Indicator (DI+) and Minus Directional Indicator (DI-): - DI+ > DI-: Bullish trend. - DI- > DI+: Bearish trend.
es: El ADX se utiliza a menudo junto con el Indicador Direccional Positivo (DI+) y el Indicador Direccional Negativo (DI-): - DI+ > DI-: Tendencia alcista. - DI- > DI+: Tendencia bajista.

source: Recommendation Types:
es: Tipos de Recomendación:

# buyRecommendationAdx
source: BUY: ADX value is above 25 and the +DI crosses above the -DI, indicating a potential bullish trend.
es: COMPRA: El valor de ADX está por encima de 25 y el +DI cruza por encima del -DI, indicando una posible tendencia alcista.

# sellRecommendationAdx
source: SELL: ADX value is above 25 and the +DI crosses below the -DI, indicating a potential bearish trend.
es: VENTA: El valor de ADX está por encima de 25 y el +DI cruza por debajo del -DI, indicando una posible tendencia bajista.

# neutralRecommendationAdx
source: NEUTRAL: ADX value is below 25, indicating a weak or absent trend.
es: NEUTRAL: El valor de ADX está por debajo de 25, indicando una tendencia débil o ausente.

# strongBuyRecommendationAdx
source: STRONG BUY: ADX value is above 50 and the +DI crosses above the -DI, indicating a very strong bullish trend.
es: COMPRA FUERTE: El valor de ADX está por encima de 50 y el +DI cruza por encima del -DI, indicando una tendencia alcista muy fuerte.

# strongSellRecommendationAdx
source: STRONG SELL: ADX value is above 50 and the +DI crosses below the -DI, indicating a very strong bearish trend.
es: VENTA FUERTE: El valor de ADX está por encima de 50 y el +DI cruza por debajo del -DI, indicando una tendencia bajista muy fuerte.

# adxTrendStrengthDesc
source: This strategy involves analyzing the strength of the trend indicated by the ADX value. A higher ADX value indicates a stronger trend, while a lower value suggests a weaker trend. Traders may use this information to identify potential entry and exit points based on trend strength.
es: Esta estrategia implica analizar la fuerza de la tendencia indicada por el valor ADX. Un valor de ADX más alto indica una tendencia más fuerte, mientras que un valor más bajo sugiere una tendencia más débil. Los operadores pueden utilizar esta información para identificar posibles puntos de entrada y salida en función de la fuerza de la tendencia.

source: Directional Movement
es: Movimiento Direccional

# adxDirectionalMovementDesc
source: The ADX indicator also provides information about the direction of the trend. When the ADX line is rising, it indicates that the trend is strengthening, regardless of its direction. Conversely, when the ADX line is falling, it suggests that the trend is weakening. Traders may use this information to confirm trend direction and make trading decisions accordingly.
es: El indicador ADX también proporciona información sobre la dirección de la tendencia. Cuando la línea ADX sube, indica que la tendencia se está fortaleciendo, independientemente de su dirección. Por el contrario, cuando la línea ADX cae, sugiere que la tendencia se está debilitando. Los operadores pueden utilizar esta información para confirmar la dirección de la tendencia y tomar decisiones comerciales en consecuencia.

# adxDivergenceDesc
source: ADX divergence occurs when the price movement is not confirmed by the ADX indicator. For example, if the price is making new highs, but the ADX indicator is making lower highs, it may indicate a weakening trend, or potential reversal. Traders may look for divergence patterns to anticipate trend changes.
es: La divergencia del ADX ocurre cuando el movimiento del precio no es confirmado por el indicador ADX. Por ejemplo, si el precio está alcanzando nuevos máximos, pero el indicador ADX está alcanzando máximos más bajos, puede indicar una tendencia debilitada o una posible reversión. Los operadores pueden buscar patrones de divergencia para anticipar cambios de tendencia.

# adxEntryExitSignalDesc
source: Some traders use specific ADX threshold levels as entry or exit signals. For example, they may enter a trade when the ADX crosses above a certain value, indicating a strong trend, and exit when it falls below another threshold, suggesting a weakening trend. These threshold levels may vary depending on the trader's strategy and market conditions.
es: Algunos operadores utilizan niveles de umbral ADX específicos como señales de entrada o salida. Por ejemplo, pueden ingresar a una operación cuando el ADX cruza por encima de cierto valor, lo que indica una tendencia fuerte, y salir cuando cae por debajo de otro umbral, lo que sugiere una tendencia debilitada. Estos niveles de umbral pueden variar según la estrategia del comerciante y las condiciones del mercado.

# understandingBollingerBandsDesc
source: Bollinger Bands are a type of statistical chart characterizing the prices and volatility over time of a financial instrument or commodity. They consist of a middle band (SMA) and two outer bands (standard deviations above and below the SMA).
es: Las Bandas de Bollinger son un indicador de análisis técnico que consiste en tres líneas: la banda superior, la banda media (SMA) y la banda inferior. La posición del precio en relación con estas bandas puede proporcionar señales comerciales.

source: Bollinger Bands Levels
es: Niveles de Bandas de Bollinger

# bollingerBandsLevelsDesc
source: The Bollinger Bands indicator consists of three lines: the upper band, middle band (SMA), and lower band. The position of the price relative to these bands can provide trading signals.
es: Las Bandas de Bollinger consisten en tres niveles: - Banda Superior: 2 desviaciones estándar por encima de la SMA. - Banda Media (SMA): Media Móvil Simple del precio. - Banda Inferior: 2 desviaciones estándar por debajo de la SMA.

# buyRecommendationBollinger
source: BUY: The price is below the lower band - Oversold.
es: COMPRA: El precio está por debajo de la banda inferior - Sobrevendido.

# strongBuyRecommendationBollinger
source: STRONG BUY: The price is below the lower band - Oversold with wide bands.
es: COMPRA FUERTE: El precio está por debajo de la banda inferior - Sobrevendido con bandas anchas.

# sellRecommendationBollinger
source: SELL: The price is above the upper band - Overbought.
es: VENTA: El precio está por encima de la banda superior - Sobrecomprado.

# strongSellRecommendationBollinger
source: STRONG SELL: The price is above the upper band - Overbought with wide bands.
es: VENTA FUERTE: El precio está por encima de la banda superior - Sobrecomprado con bandas anchas.

# neutralRecommendationBollinger
source: NEUTRAL: Narrow bands - Neutral or within the Bollinger bands.
es: NEUTRAL: Bandas estrechas - Neutral o Dentro de las bandas de Bollinger.

source: Upper Band
es: Banda Superior

source: Middle Band
es: Banda Media

source: Lower Band
es: Banda Inferior

source: Band Width
es: Ancho de Banda

# overboughtWideBands
source: Price above Upper Band - Overbought with Wide Bands
es: Precio por encima de la banda superior - Sobrecompra con bandas anchas

# bollingerBandsOverbought
source: Price above Upper Band - Overbought
es: Precio por encima de la banda superior - Sobrecompra

# oversoldWideBands
source: Price below Lower Band - Oversold with Wide Bands
es: Precio por debajo de la banda inferior - Sobreventa con bandas anchas

# bollingerBandsOversold
source: Price below Lower Band - Oversold
es: Precio por debajo de la banda inferior - Sobreventa

source: Narrow Bands - Neutral
es: Precio cerca de la banda media - Sin una señal clara

source: Within Bollinger Bands
es: Precio dentro de las bandas - Sin una señal clara

# bollinger_band_squeeze_title
source: Bollinger Band Squeeze
es: Apretón de la banda de Bollinger

# bollinger_band_squeeze_description
source: The Bollinger Band Squeeze strategy is based on the principle that periods of low volatility are often followed by periods of high volatility. When the bands squeeze together, it indicates that the volatility is low and a breakout could occur. Traders watch for a price move above or below the bands as a signal for potential entry.
es: La estrategia de apreton de bandas de Bollinger se basa en el principio de que los períodos de baja volatilidad suelen ir seguidos de períodos de alta volatilidad. Cuando las bandas se juntan, indica que la volatilidad es baja y podría ocurrir una ruptura. Los operadores observan un movimiento de precios por encima o por debajo de las bandas como señal de una posible entrada.

# bollinger_band_breakout_title
source: Bollinger Band Breakout
es: Ruptura de la banda de Bollinger

# bollinger_band_breakout_description
source: The Bollinger Band Breakout strategy looks for price breaking out of the upper or lower bands. A breakout above the upper band can signal that the price is in a strong uptrend, while a breakout below the lower band can signal a strong downtrend. Traders often use this strategy to enter trades in the direction of the breakout.
es: La estrategia de ruptura de las bandas Bollinger busca que el precio rompa las bandas superior o inferior. Una ruptura por encima de la banda superior puede indicar que el precio se encuentra en una fuerte tendencia alcista, mientras que una ruptura por debajo de la banda inferior puede indicar una fuerte tendencia a la baja. Los operadores suelen utilizar esta estrategia para realizar operaciones en la dirección de la ruptura.

# reversion_to_mean_title
source: Reversion to the Mean
es: Reversión a la media

# reversion_to_mean_description
source: This strategy assumes that price tends to return to the middle band (the simple moving average) after touching the upper or lower bands. When the price hits the upper band, traders might look for sell signals, anticipating that the price will revert back to the mean. Conversely, when the price hits the lower band, traders might look for buy signals.
es: Esta estrategia supone que el precio tiende a volver a la banda media (la media móvil simple) después de tocar las bandas superior o inferior. Cuando el precio alcanza la banda superior, los operadores pueden buscar señales de venta, anticipando que el precio volverá a la media. Por el contrario, cuando el precio alcanza la banda inferior, los operadores pueden buscar señales de compra.

# double_bottoms_and_tops_title
source: Double Bottoms and Tops
es: Dobles suelos y techos

# double_bottoms_and_tops_description
source: Double bottoms and tops are reversal patterns that can be identified using Bollinger Bands. A double bottom occurs when the price makes two lows around the same level, often with a lower low touching or going below the lower band, followed by a rally. A double top occurs when the price makes two highs around the same level, often with an upper high touching or exceeding the upper band, followed by a decline.
es: Los dobles suelos y techos son patrones de inversión que se pueden identificar utilizando las Bandas de Bollinger. Un doble suelo ocurre cuando el precio alcanza dos mínimos alrededor del mismo nivel, a menudo con un mínimo más bajo tocando o yendo por debajo de la banda inferior, seguido de un repunte. Un doble techo ocurre cuando el precio alcanza dos máximos alrededor del mismo nivel, a menudo con un máximo superior tocando o superando la banda superior, seguido de una caída.

# understandingMacdDesc
source: The MACD is a trend-following momentum indicator that shows the relationship between two moving averages of a securityâ€™s price. It consists of the MACD line, signal line, and histogram.
es: El MACD es un indicador de impulso que sigue la tendencia y muestra la relación entre dos promedios móviles del precio de un valor. Consta de la línea MACD, la línea de señal y el histograma.

# buyRecommendationMacd
source: BUY: The MACD crosses above the signal line, indicating a bullish trend.
es: COMPRA: El MACD cruza por encima de la línea de señal, indicando una tendencia alcista

# sellRecommendationMacd
source: SELL: The MACD crosses below the signal line, indicating a bearish trend.
es: VENTA: El MACD cruza por debajo de la línea de señal, indicando una tendencia bajista

# neutralRecommendationMacd
source: NEUTRAL: No clear signal is identified by the MACD indicator, possibly due to the proximity between the MACD and the signal line.
es: NEUTRAL: No se identifica una señal clara por el indicador MACD, posiblemente debido a la proximidad entre el MACD y la línea de señal.

# strongBuyRecommendationMacd
source: STRONG BUY: The MACD crosses above the signal line with an increasing histogram, indicating a strong bullish trend.
es: COMPRA FUERTE: El MACD cruza por encima de la línea de señal con un histograma creciente, indicando una fuerte tendencia alcista.

# strongSellRecommendationMacd
source: STRONG SELL: The MACD crosses below the signal line with a decreasing histogram, indicating a strong bearish trend.
es: VENTA FUERTE: El MACD cruza por debajo de la línea de señal con un histograma decreciente, indicando una fuerte tendencia bajista.

# recommendationLogicDescMacd
source: When the MACD line crosses above the signal line, it is considered a bullish signal, indicating a potential buy opportunity. Conversely, when the MACD line crosses below the signal line, it is considered a bearish signal, indicating a potential sell opportunity.
es: Cuando la línea MACD cruza por encima de la línea de señal, se considera una señal alcista, lo que indica una posible oportunidad de compra. Por el contrario, cuando la línea MACD cruza por debajo de la línea de señal, se considera una señal bajista, lo que indica una posible oportunidad de venta.

# macdLineSignalCorss
source: MACD Line and Signal Line Crossover
es: Cruce de Línea MACD y Línea de Señal

# macdLineSignalCorssDesc
source: This strategy involves identifying buy and sell signals based on the crossover of the MACD line and the signal line. A bullish crossover occurs when the MACD line crosses above the signal line, indicating a potential buy signal. Conversely, a bearish crossover occurs when the MACD line crosses below the signal line, indicating a potential sell signal.
es: Esta estrategia implica identificar señales de compra y venta basadas en el cruce de la línea MACD y la línea de señal. Un cruce alcista ocurre cuando la línea MACD cruza por encima de la línea de señal, lo que indica una señal de compra potencial. Por el contrario, una señal bajista El cruce se produce cuando la línea MACD cruza por debajo de la línea de señal, lo que indica una posible señal de venta.

source: MACD Histogram
es: Histograma MACD

# macdHistogramDesc
source: In this strategy, traders look for changes in the MACD histogram. When the histogram moves from negative to positive territory, it suggests increasing bullish momentum. Conversely, when the histogram moves from positive to negative territory, it suggests increasing bearish momentum.
es: En esta estrategia, los operadores buscan cambios en el histograma MACD. Cuando el histograma pasa de territorio negativo a positivo, sugiere un creciente impulso alcista. Por el contrario, cuando el histograma pasa de territorio positivo a negativo, sugiere un impulso bajista creciente.

# macdDivergencePrice
source: Divergence with Price
es: Divergencia de Precio

# macdDivergencePriceDesc
source: Similar to RSI divergence, traders can use MACD divergence to identify potential trend reversals. A bullish divergence occurs when the price makes a lower low, but the MACD indicator forms a higher low. Conversely, a bearish divergence occurs when the price makes a higher high, but the MACD indicator forms a lower high.
es: De manera similar a la divergencia del RSI, los operadores pueden utilizar la divergencia del MACD para identificar posibles cambios de tendencia. Se produce una divergencia alcista cuando el precio alcanza un mínimo más bajo, pero el indicador MACD forma un mínimo más alto. Por el contrario, se produce una divergencia bajista cuando el precio alcanza un máximo más alto, pero el indicador MACD forma un máximo más bajo.

source: Bearish Divergence
es: Divergencia Bajista

# macdSignalBullish
source: MACD and signal in bullish territory
es: MACD y señal en territorio alcista

source: Conflicting signals
es: Señales Conflictivas

source: Bullish Divergence
es: Divergencia Alcista

# macdSignalBearish
source: MACD and signal in bearish territory
es: MACD y señal en territorio bajista

source: Current Parabolic SAR
es: SAR Parabólico Actual

source: Previous Parabolic SAR
es: SAR Parabólico Anterior

source: Trend Direction
es: Dirección de la Tendencia

source: Upward Trend
es: Tendencia Alcista

source: Downward Trend
es: Tendencia Bajista

source: No Clear Trend
es: Sin Tendencia Clara

# buyRecommendationParabolicSAR
source: BUY: SAR is currently below the price, indicating a potential bullish trend.
es: COMPRA: SAR está actualmente por debajo del precio, lo que indica una posible tendencia alcista.

# strongBuyRecommendationParabolicSAR
source: STRONG BUY: SAR is significantly below the price, indicating a strong bullish trend.
es: COMPRA FUERTE: SAR está significativamente por debajo del precio, lo que indica una fuerte tendencia alcista.

# sellRecommendationParabolicSAR
source: SELL: SAR is currently above the price, indicating a potential bearish trend.
es: VENTA: SAR está actualmente por encima del precio, lo que indica una posible tendencia bajista.

# strongSellRecommendationParabolicSAR
source: STRONG SELL: SAR is significantly above the price, indicating a strong bearish trend.
es: VENTA FUERTE: SAR está significativamente por encima del precio, lo que indica una fuerte tendencia bajista.

# neutralRecommendationParabolicSAR
source: NEUTRAL: SAR is not significantly above or below the price, suggesting a lack of clear trend direction.
es: NEUTRAL: SAR no está significativamente por encima ni por debajo del precio, lo que sugiere la falta de una dirección clara de la tendencia.

# understandingParabolicSARDesc
source: The Parabolic SAR (Stop and Reverse) is a technical indicator used to identify potential reversals in the price direction of an asset. It is represented by a series of dots above or below the price chart, indicating the potential direction of the trend.
es: El SAR Parabólico (Stop and Reverse) es un indicador técnico que se utiliza para identificar posibles reversiones en la dirección del precio de un activo. Está representado por una serie de puntos encima o debajo del gráfico de precios, que indican la dirección potencial de la tendencia.
