Repository: agustin-y2k/IndicatorInsight
Catalog: frontend/app/l10n/*.arb
Languages: es

# recommendationLogicItem1
source: If the current SAR value is greater than the previous SAR value and the current price is greater than the previous price, it indicates an uptrend and a possible buying opportunity.
es: Si el valor SAR actual es mayor que el valor SAR anterior y el precio actual es mayor que el precio anterior, indica una tendencia alcista y una posible oportunidad de compra.

# recommendationLogicItem2
source: If the current SAR value is lower than the previous SAR value and the current price is lower than the previous price, it indicates a bearish trend and a possible selling opportunity.
es: Si el valor SAR actual es menor que el valor SAR anterior y el precio actual es menor que el precio anterior, indica una tendencia bajista y una posible oportunidad de venta.

source: Trend Reversal
es: Reversión de Tendencia

source: Trailing Stop Loss
es: Stop Loss Dinámico

source: Trend Following
es: Seguimiento de Tendencia

# trendReversalDescription
source: This strategy involves identifying potential trend reversals based on the movement of the Parabolic SAR indicator. A reversal from above the price to below the price suggests a potential bullish trend reversal, while a reversal from below the price to above the price suggests a potential bearish trend reversal.
es: Esta estrategia implica identificar posibles cambios de tendencia en función del movimiento del indicador Parabolic SAR. Una reversión desde arriba del precio hacia debajo del precio sugiere una posible reversión de la tendencia alcista, mientras que una reversión desde debajo del precio hasta por encima del precio sugiere una posible reversión de la tendencia bajista.

# trailingStopLossDescription
source: In this strategy, traders use the Parabolic SAR as a trailing stop loss mechanism. As the price moves in favor of the trade, the Parabolic SAR moves closer to the price, acting as a dynamic stop loss level. If the price reverses and the Parabolic SAR crosses the price, it triggers a stop loss.
es: En esta estrategia, los operadores utilizan el SAR Parabólico como mecanismo de stop loss dinámico. A medida que el precio se mueve a favor de la operación, el SAR Parabólico se acerca al precio, actuando como un nivel dinámico de parada de pérdidas. Si el precio se revierte y el SAR Parabólico cruza el precio, se activa un stop loss.

# trendFollowingDescription
source: Traders can use the Parabolic SAR to follow the trend by entering positions in the direction of the SAR. In an uptrend, traders look for buy signals when the SAR moves below the price, indicating bullish momentum. In a downtrend, traders look for sell signals when the SAR moves above the price, indicating bearish momentum.
es: Los operadores pueden utilizar el SAR Parabólico para seguir la tendencia ingresando posiciones en la dirección del SAR. En una tendencia alcista, los operadores buscan señales de compra cuando el SAR se mueve por debajo del precio, lo que indica un impulso alcista. En una tendencia bajista, los operadores buscan señales de venta cuando el SAR se mueve por encima del precio, lo que indica un impulso bajista.

# understandingRSIDesc
source: The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements. It is primarily used to identify overbought or oversold conditions in a market.
es: El índice de fuerza relativa (RSI) es un oscilador de impulso que mide la velocidad y el cambio de los movimientos de precios. Se utiliza principalmente para identificar condiciones de sobrecompra o sobreventa en un mercado.

# buyRecommendationRSI
source: BUY: RSI < 30 and starts to rise, indicating an oversold condition and a potential buying opportunity.
es: COMPRA: RSI < 30, indicando una condición de sobreventa y una posible oportunidad de compra.

# strongBuyRecommendationRSI
source: STRONG BUY: RSI < 20 and starts to rise, indicating a very oversold condition and a strong buying opportunity.
es: COMPRA FUERTE: RSI < 20, indicando una condición muy sobrevendida y una fuerte oportunidad de compra.

# sellRecommendationRSI
source: SELL: RSI > 70 and starts to fall, indicating an overbought condition and a potential selling opportunity.
es: VENTA: RSI > 70, indicando una condición de sobrecompra y una posible oportunidad de venta.

# strongSellRecommendationRSI
source: STRONG SELL: RSI > 80 and starts to fall, indicating a very overbought condition and a strong selling opportunity.
es: VENTA FUERTE: RSI > 80, indicando una condición muy sobrecomprada y una fuerte oportunidad de venta.

# neutralRecommendationRSI
source: NEUTRAL: RSI between 30 and 70, indicating no clear overbought or oversold conditions.
es: NEUTRAL: RSI entre 30 y 70, sin una señal clara.

source: Overbought/Oversold Levels
es: Niveles de Sobrecompra/Sobreventa

# overboughtOversoldLevelsRSIDesc
source: This strategy involves identifying overbought and oversold conditions using the RSI indicator. When the RSI value exceeds 70, it's considered overbought, indicating a potential sell signal. Conversely, when the RSI value drops below 30, it's considered oversold, indicating a potential buy signal.
es: Esta estrategia implica identificar condiciones de sobrecompra y sobreventa utilizando el indicador RSI. Cuando el valor del RSI supera 70, se considera sobrecompra, lo que indica una posible señal de venta. Por el contrario, cuando el valor del RSI cae por debajo de 30, se considera sobrevendido, lo que indica una posible señal de compra.

# divergenceRSIDesc
source: In this strategy, traders look for divergences between the price and the RSI indicator. A bullish divergence occurs when the price makes a lower low, but the RSI indicator forms a higher low, suggesting potential upward momentum. Conversely, a bearish divergence occurs when the price makes a higher high, but the RSI indicator forms a lower high, suggesting potential downward momentum.
es: En esta estrategia, los operadores buscan divergencias entre el precio y el indicador RSI. Se produce una divergencia alcista cuando el precio alcanza un mínimo más bajo, pero el indicador RSI forma un mínimo más alto, lo que sugiere un posible impulso alcista. Por el contrario, se produce una divergencia bajista cuando el precio alcanza un máximo más alto, pero el indicador RSI forma un máximo más bajo, lo que sugiere un posible impulso a la baja.

source: Trend Confirmation
es: Confirmación de Tendencia

# trengConfirmationRSIDesc
source: This strategy involves using the RSI indicator to confirm trends identified by other indicators or price action. When the RSI value confirms a bullish trend by staying above a certain threshold (e.g., 50), it reinforces the bullish bias. Similarly, when the RSI value confirms a bearish trend by staying below a certain threshold, it reinforces the bearish bias.
es: Esta estrategia implica el uso del indicador RSI para confirmar las tendencias identificadas por otros indicadores o la acción del precio. Cuando el valor del RSI confirma una tendencia alcista manteniéndose por encima de un cierto umbral (por ejemplo, 50), refuerza el sesgo alcista. De manera similar, cuando el valor del RSI confirma una tendencia bajista al mantenerse por debajo de cierto umbral, refuerza el sesgo bajista.

# understandingStochasticDesc
source: The Stochastic Oscillator is a momentum indicator that compares a particular closing price of a security to a range of its prices over a certain period of time. It oscillates between 0 and 100 and is used to identify potential overbought or oversold conditions in a market.
es: El oscilador estocástico es un indicador de impulso que compara un precio de cierre particular de un valor con un rango de sus precios durante un período de tiempo determinado. Oscila entre 0 y 100 y se utiliza para identificar posibles condiciones de sobrecompra o sobreventa en un mercado.

# buyRecommendationStochastic
source: BUY: The stochastic indicator suggests a potential buying opportunity when SlowK and SlowD are low (below 20) and SlowK crosses above SlowD.
es: COMPRA: El indicador estocástico sugiere una posible oportunidad de compra cuando SlowK y SlowD son bajos (por debajo de 20) y SlowK cruza por encima de SlowD.

# strongBuyRecommendationStochastic
source: STRONG BUY: The stochastic indicator shows a strong buying signal when SlowK and SlowD are very low (below 10) and SlowK crosses above SlowD.
es: COMPRA FUERTE: El indicador estocástico muestra una fuerte señal de compra cuando SlowK y SlowD son muy bajos (por debajo de 10) y SlowK cruza por encima de SlowD.

# sellRecommendationStochastic
source: SELL: The stochastic indicator suggests a potential selling opportunity when SlowK and SlowD are high (above 80) and SlowK crosses below SlowD.
es: VENTA: El indicador estocástico sugiere una posible oportunidad de venta cuando SlowK y SlowD son altos (por encima de 80) y SlowK cruza por debajo de SlowD.

# strongSellRecommendationStochastic
source: STRONG SELL: The stochastic indicator shows a strong selling signal when SlowK and SlowD are very high (above 90) and SlowK crosses below SlowD.
es: VENTA FUERTE: El indicador estocástico muestra una fuerte señal de venta cuando SlowK y SlowD son muy altos (por encima de 90) y SlowK cruza por debajo de SlowD.

# neutralRecommendationStochastic
source: NEUTRAL: The stochastic indicator indicates a neutral condition when SlowK and SlowD are between 20 and 80, suggesting that there is no clear signal of overbought or oversold.
es: NEUTRAL: El indicador estocástico indica una condición neutral cuando SlowK y SlowD están entre 20 y 80, lo que sugiere que no hay una clara señal de sobrecompra o sobreventa.

# overboughtOversoldLevelsStochasticDesc
source: This strategy involves identifying overbought and oversold conditions using the stochastic oscillator. When the %K line crosses above 80, it indicates overbought conditions and suggests a potential sell signal. Conversely, when the %K line crosses below 20, it indicates oversold conditions and suggests a potential buy signal.
es: Esta estrategia implica identificar condiciones de sobrecompra y sobreventa utilizando el oscilador estocástico. Cuando la línea %K cruza por encima de 80, indica condiciones de sobrecompra y sugiere una posible señal de venta. Por el contrario, cuando la línea %K cruza por debajo de 20, indica condiciones de sobreventa y sugiere una posible señal de compra.

# divergenceStochasticDesc
source: In this strategy, traders look for divergences between the price and the stochastic oscillator. A bullish divergence occurs when the price makes a lower low, but the stochastic oscillator forms a higher low, suggesting potential upward momentum. Conversely, a bearish divergence occurs when the price makes a higher high, but the stochastic oscillator forms a lower high, suggesting potential downward momentum.
es: En esta estrategia, los operadores buscan divergencias entre el precio y el oscilador estocástico. Se produce una divergencia alcista cuando el precio alcanza un mínimo más bajo, pero el oscilador estocástico forma un mínimo más alto, lo que sugiere un posible impulso alcista. Por el contrario, se produce una divergencia bajista cuando el precio alcanza un máximo más alto, pero el oscilador estocástico forma un máximo más bajo, lo que sugiere un posible impulso a la baja.

# trendConfirmationStochasticDesc
source: This strategy involves using the stochastic oscillator to confirm trends identified by other indicators or price action. When the %K line confirms a bullish trend by staying above a certain threshold (e.g., 50), it reinforces the bullish bias. Similarly, when the %K line confirms a bearish trend by staying below a certain threshold, it reinforces the bearish bias.
es: Esta estrategia implica el uso del oscilador estocástico para confirmar tendencias identificadas por otros indicadores o la acción del precio. Cuando la línea %K confirma una tendencia alcista manteniéndose por encima de un cierto umbral (por ejemplo, 50), refuerza el sesgo alcista. De manera similar, cuando la línea %K confirma una tendencia bajista al permanecer por debajo de cierto umbral, refuerza el sesgo bajista.

# understandingWilliamsRDesc
source: The Williams %R (%R) indicator is a momentum oscillator that measures overbought or oversold levels. It oscillates between -100 and 0, where values above -20 are considered overbought and values below -80 are considered oversold.
es: El indicador Williams %R (%R) es un oscilador de impulso que mide los niveles de sobrecompra o sobreventa. Oscila entre -100 y 0, donde los valores superiores a -20 se consideran sobrecomprados y los valores inferiores a -80 se consideran sobrevendidos.

# buyRecommendationWilliamsR
source: BUY: Williams %R is between -80 and -50, indicating an oversold condition and a potential buying opportunity.
es: COMPRA: Williams %R se encuentra entre -80 y -50, indicando una condición de sobreventa y una posible oportunidad de compra.

# strongBuyRecommendationWilliamsR
source: STRONG BUY: Williams %R is below -80, indicating a very oversold condition and a strong buying opportunity.
es: COMPRA FUERTE: Williams %R es inferior a -80, indicando una condición muy sobrevendida y una fuerte oportunidad de compra.

# sellRecommendationWilliamsR
source: SELL: Williams %R is between -20 and -50, indicating an overbought condition and a potential selling opportunity.
es: VENTA: Williams %R se encuentra entre -20 y -50, indicando una condición de sobrecompra y una posible oportunidad de venta.

# strongSellRecommendationWilliamsR
source: STRONG SELL: Williams %R is above -20, indicating a very overbought condition and a strong selling opportunity.
es: VENTA FUERTE: Williams %R es superior a -20, indicando una condición muy sobrecomprada y una fuerte oportunidad de venta.

# neutralRecommendationWilliamsR
source: NEUTRAL: Williams %R doesn't present a clear signal of overbought or oversold conditions, suggesting a neutral condition.
es: NEUTRAL: Williams %R no presenta una señal clara de sobrecompra o sobreventa, lo que sugiere una condición neutral.

# overboughtOversoldLevelsWRDesc
source: This strategy involves identifying overbought and oversold conditions using the Williams %R indicator. When the Williams %R value exceeds -20, it's considered overbought, indicating a potential sell signal. Conversely, when the Williams %R value drops below -80, it's considered oversold, indicating a potential buy signal.
es: Esta estrategia implica identificar condiciones de sobrecompra y sobreventa utilizando el indicador Williams %R. Cuando el valor Williams %R supera -20, se considera sobrecomprado, lo que indica una posible señal de venta. Por el contrario, cuando el valor Williams %R cae por debajo de -80, se considera sobrevendido, lo que indica una posible señal de compra.

# divergenceWRDesc
source: In this strategy, traders look for divergences between the price and the Williams %R indicator. A bullish divergence occurs when the price makes a lower low, but the Williams %R indicator forms a higher low, suggesting potential upward momentum. Conversely, a bearish divergence occurs when the price makes a higher high, but the Williams %R indicator forms a lower high, suggesting potential downward momentum.
es: En esta estrategia, los operadores buscan divergencias entre el precio y el indicador Williams %R. Se produce una divergencia alcista cuando el precio alcanza un mínimo más bajo, pero el indicador Williams %R forma un mínimo más alto, lo que sugiere un potencial impulso alcista. Por el contrario, se produce una divergencia bajista cuando el precio alcanza un máximo más alto, pero el indicador Williams %R forma un máximo más bajo, lo que sugiere un posible impulso a la baja.

# trengConfirmationWRDesc
source: This strategy involves using the Williams %R indicator to confirm trends identified by other indicators or price action. When the Williams %R value confirms a bullish trend by staying above a certain threshold (e.g., -50), it reinforces the bullish bias. Similarly, when the Williams %R value confirms a bearish trend by staying below a certain threshold, it reinforces the bearish bias.
es: Esta estrategia implica el uso del indicador Williams %R para confirmar las tendencias identificadas por otros indicadores o la acción del precio. Cuando el valor Williams %R confirma una tendencia alcista manteniéndose por encima de un cierto umbral (por ejemplo, -50), refuerza el sesgo alcista. De manera similar, cuando el valor Williams %R confirma una tendencia bajista al permanecer por debajo de cierto umbral, refuerza el sesgo bajista.

source: Moving Averages Crossover
es: Cruce de Medias Móviles

# movingAveragesCrossoverDesc
source: This strategy involves using two moving averages with different time periods. When the shorter moving average crosses above the longer one, it's considered a buy signal, indicating a possible uptrend. Conversely, when the shorter moving average crosses below the longer one, it's considered a sell signal, indicating a possible downtrend.
es: Esta estrategia implica el uso de dos medias móviles con diferentes períodos de tiempo. Cuando la media móvil más corta cruza por encima de la más larga, se considera una señal de compra, lo que indica una posible tendencia alcista. Por el contrario, cuando la media móvil más corta cruza por debajo de la más larga, se considera una señal de venta, lo que indica una posible tendencia bajista.

# movingAveragesSupportResistance
source: Moving Averages as Support and Resistance
es: Medias Móviles como Soporte/Resistencia

# movingAveragesSupportResistanceDesc
source: In this strategy, a single moving average is used as a dynamic support or resistance level. When the price approaches the moving average from above, it may act as resistance, and when the price approaches from below, it may act as support. Traders may look for buying opportunities when the price bounces off the moving average from below and selling opportunities when the price bounces from above.
es: En esta estrategia, se utiliza una única media móvil como nivel de soporte o resistencia dinámico. Cuando el precio se acerca a la media móvil desde arriba, puede actuar como resistencia, y cuando el precio se acerca desde abajo, puede actuar como soporte. Los operadores pueden buscar oportunidades de compra cuando el precio rebota en el promedio móvil desde abajo y oportunidades de venta cuando el precio rebota desde arriba.

source: Moving Averages Reversal Signal
es: Señal de Reversión de Medias Móviles

# movingAveragesReversalSignalDesc
source: Some traders use moving averages to identify potential reversal points in the market. For example, when the price significantly deviates from a particular moving average, it may indicate that the current trend is overextended and a reversal is likely. Traders may look for reversal signals when the price approaches the moving average again.
es: Algunos operadores utilizan promedios móviles para identificar posibles puntos de reversión en el mercado. Por ejemplo, cuando el precio se desvía significativamente de una media móvil particular, puede indicar que la tendencia actual está demasiado extendida y es probable que se produzca una reversión. Los operadores pueden buscar señales de reversión cuando el precio se acerque nuevamente a la media móvil.

# simpleMovingAverage
source: Simple Moving Average (SMA)
es: Media Móvil Simple (SMA)

# simpleMovingAverageDesc
source: The SMA is calculated by averaging the closing prices over a specified period. It smooths out price data to identify trends over a longer duration.
es: La SMA se calcula promediando los precios de cierre durante un período específico. Suaviza los datos de precios para identificar tendencias a largo plazo.

# exponentialMovingAverage
source: Exponential Moving Average (EMA)
es: Media Móvil Exponencial (EMA)

# exponentialMovingAverageDesc
source: The EMA gives more weight to recent prices, making it more responsive to new information. It is useful for identifying short-term trends.
es: La EMA da más peso a los precios recientes, lo que la hace más receptiva a la nueva información. Es útil para identificar tendencias a corto plazo.

# weightedMovingAverage
source: Weighted Moving Average (WMA)
es: Media Móvil Ponderada (WMA)

# weightedMovingAverageDesc
source: The WMA assigns different weights to each closing price within the given period, giving more importance to recent data points.
es: La WMA asigna diferentes ponderaciones a cada precio de cierre dentro del período determinado, dando más importancia a los datos recientes.

# buyRecommendationMovingAverages
source: BUY: If the last closing price is above the last moving average value.
es: COMPRA: Si el último precio de cierre está por encima del último valor del promedio móvil.

# strongBuyRecommendationMovingAverages
source: STRONG BUY: If the last closing price is more than 5% above the last moving average value.
es: COMPRA FUERTE: Si el último precio de cierre está más de un 5% por encima del último valor del promedio móvil.

# sellRecommendationMovingAverages
source: SELL: If the last closing price is below the last moving average value.
es: VENTA: Si el último precio de cierre está por debajo del último valor del promedio móvil.

# strongSellRecommendationMovingAverages
source: STRONG SELL: If the last closing price is more than 5% below the last moving average value.
es: VENTA FUERTE: Si el último precio de cierre está más de un 5% por debajo del último valor del promedio móvil.

# neutralRecommendationMovingAverages
source: NEUTRAL: If the last closing price is equal to the last moving average value.
es: NEUTRAL: Si el último precio de cierre es igual al último valor del promedio móvil.

source: Golden Cross
es: Cruz Dorada

# goldenCrossDesc
source: Golden Cross: Indicates a potential buy signal when the short-term moving average crosses above the long-term moving average.
es: Cruz Dorada: Indica una señal de compra potencial cuando el promedio móvil de corto plazo cruza por encima del promedio móvil de largo plazo.

source: Death Cross
es: Cruz de la Muerte

# deathCrossDesc
source: Death Cross: Indicates a potential sell signal when the short-term moving average crosses below the long-term moving average.
es: Cruz de la Muerte: Indica una señal de venta potencial cuando el promedio móvil de corto plazo cruza por debajo del promedio móvil de largo plazo.
